labapart/polymcu/Device/Nordic/nRF5_SDK/components/libraries/usbd/class/msc/app_usbd_msc.c
    app_usbd_scsi_cmd_modesense6_resp_t * p_resp = &p_msc_ctx->scsi_resp.modesense6;
    p_resp->mdlen = sizeof(app_usbd_scsi_cmd_modesense6_resp_t) - 1;
    p_resp->type = 0;
    p_resp->param = 0;
    p_resp->bdlen = 0;

    return transfer_in_start(p_inst,
                             &p_msc_ctx->scsi_resp,
                             p_msc_ctx->resp_len,
                             APP_USBD_MSC_STATE_CMD_IN);
}

/**
 * @brief SCSI Command: @ref APP_USBD_SCSI_CMD_STARTSTOPUNIT handle
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_msc         MSC instance
 * @param[in] p_msc_ctx     MSC context
 * @return Standard error code
 * */
static ret_code_t cmd_startstopunit(app_usbd_class_inst_t const * p_inst,
                                    app_usbd_msc_t const *        p_msc,
                                    app_usbd_msc_ctx_t *          p_msc_ctx)
{
    NRF_LOG_DEBUG("CMD: STARTSTOPUNIT\r\n");
    return csw_wait_start(p_inst, APP_USBD_MSC_CSW_STATUS_PASS);
}


/**
 * @brief SCSI Command: @ref APP_USBD_SCSI_CMD_SENDDIAGNOSTIC handle
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_msc         MSC instance
 * @param[in] p_msc_ctx     MSC context
 * @return Standard error code
 * */
static ret_code_t cmd_senddiagnostic(app_usbd_class_inst_t const * p_inst,
                                     app_usbd_msc_t const *        p_msc,
                                     app_usbd_msc_ctx_t *          p_msc_ctx)
{
    NRF_LOG_DEBUG("CMD: SENDDIAGNOSTIC\r\n");
    return csw_wait_start(p_inst, APP_USBD_MSC_CSW_STATUS_PASS);
}

/**
 * @brief SCSI Command: @ref APP_USBD_SCSI_CMD_PREVENTMEDIAREMOVAL handle
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_msc         MSC instance
 * @param[in] p_msc_ctx     MSC context
 * @return Standard error code
 * */
static ret_code_t cmd_preventremoval(app_usbd_class_inst_t const * p_inst,
                                     app_usbd_msc_t const *        p_msc,
                                     app_usbd_msc_ctx_t *          p_msc_ctx)
{
    NRF_LOG_DEBUG("CMD: PREVENTMEDIAREMOVAL\r\n");
    return csw_wait_start(p_inst, APP_USBD_MSC_CSW_STATUS_PASS);
}

/**
 * @brief SCSI Command: @ref APP_USBD_SCSI_CMD_READCAPACITY10 handle
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_msc         MSC instance
 * @param[in] p_msc_ctx     MSC context
 * @return Standard error code
 * */
static ret_code_t cmd_readcapacity10(app_usbd_class_inst_t const * p_inst,
                                     app_usbd_msc_t const *        p_msc,
                                     app_usbd_msc_ctx_t *          p_msc_ctx)
{
    NRF_LOG_DEBUG("CMD: READCAPACITY10\r\n");

    app_usbd_scsi_cmd_readcapacity10_t const * p_cap10 = (const void *)p_msc_ctx->cbw.cdb;
    UNUSED_VARIABLE(p_cap10);
    if (p_msc_ctx->cbw.cdb_length < sizeof(app_usbd_scsi_cmd_readcapacity10_t))
    {
        return unsupported_start(p_inst);
    }

    if (p_msc_ctx->cbw.lun >= p_msc->specific.inst.block_devs_count)
    {
        return unsupported_start(p_inst);
    }

    p_msc_ctx->resp_len = uint32_decode(p_msc_ctx->cbw.datlen);
    p_msc_ctx->resp_len = MIN(p_msc_ctx->resp_len,
                              sizeof(app_usbd_scsi_cmd_readcapacity10_resp_t));

    if (p_msc_ctx->resp_len == 0)
    {
        return csw_wait_start(p_inst, APP_USBD_MSC_CSW_STATUS_PASS);
    }

    nrf_block_dev_t const * p_blkd = p_msc->specific.inst.pp_block_devs[p_msc_ctx->cbw.lun];
    nrf_block_dev_geometry_t const * p_geometry = nrf_blk_dev_geometry(p_blkd);

    (void)uint32_big_encode(p_geometry->blk_count - 1, p_msc_ctx->scsi_resp.readcapacity10.lba);
    (void)uint32_big_encode(p_geometry->blk_size, p_msc_ctx->scsi_resp.readcapacity10.blklen);

    return transfer_in_start(p_inst,
                             &p_msc_ctx->scsi_resp,
                             p_msc_ctx->resp_len,
                             APP_USBD_MSC_STATE_CMD_IN);
}

/**
 * @brief SCSI Command: @ref APP_USBD_SCSI_CMD_READ10 handle
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_msc         MSC instance
 * @param[in] p_msc_ctx     MSC context
 * @return Standard error code
 * */
static ret_code_t cmd_read10(app_usbd_class_inst_t const * p_inst,
                             app_usbd_msc_t const *        p_msc,
                             app_usbd_msc_ctx_t *          p_msc_ctx)
{
    NRF_LOG_DEBUG("CMD: READ10\r\n");
    app_usbd_scsi_cmd_read10_t const * p_read10 = (const void *)p_msc_ctx->cbw.cdb;
    if (p_msc_ctx->cbw.cdb_length < sizeof(app_usbd_scsi_cmd_read10_t))
    {
        return unsupported_start(p_inst);
    }

    if (p_msc_ctx->cbw.lun >= p_msc->specific.inst.block_devs_count)
    {
        return unsupported_start(p_inst);
    }

    if (uint32_decode(p_msc_ctx->cbw.datlen) == 0)
    {
        return csw_wait_start(p_inst, APP_USBD_MSC_CSW_STATUS_FAIL);
    }

    if ((p_msc_ctx->cbw.flags & APP_USBD_MSC_CBW_DIRECTION_IN) == 0)
    {
        return unsupported_start(p_inst);
    }

    nrf_block_dev_t const * p_blkd = p_msc->specific.inst.pp_block_devs[p_msc_ctx->cbw.lun];

    p_msc_ctx->current.lun = p_msc_ctx->cbw.lun;
    p_msc_ctx->current.blk_idx = uint32_big_decode(p_read10->lba);
    p_msc_ctx->current.blk_datasize = uint32_decode(p_msc_ctx->cbw.datlen);
    p_msc_ctx->current.blk_size = nrf_blk_dev_geometry(p_blkd)->blk_size;
    p_msc_ctx->current.blk_count = next_transfer_blkcnt_calc(p_msc, p_msc_ctx);

    uint16_t blocks = uint16_big_decode(p_read10->xfrlen);
    p_msc_ctx->current.csw_status =
            uint32_decode(p_msc_ctx->cbw.datlen) < p_msc_ctx->current.blk_size * blocks ?
            APP_USBD_MSC_CSW_STATUS_FAIL : APP_USBD_MSC_CSW_STATUS_PASS;

    if (p_msc_ctx->current.blk_datasize > p_msc_ctx->current.blk_size * blocks)
    {
        p_msc_ctx->current.residue = p_msc_ctx->current.blk_datasize -
                                     p_msc_ctx->current.blk_size * blocks;
    }

    return cmd_read_start(p_inst, p_msc, p_msc_ctx);
}


/**
 * @brief SCSI Command: @ref APP_USBD_SCSI_CMD_WRITE10 handle
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_msc         MSC instance
 * @param[in] p_msc_ctx     MSC context
 * @return Standard error code
 * */
static ret_code_t cmd_write10(app_usbd_class_inst_t const * p_inst,
                              app_usbd_msc_t const *        p_msc,
                              app_usbd_msc_ctx_t *          p_msc_ctx)
{
    NRF_LOG_DEBUG("CMD: WRITE10\r\n");
    app_usbd_scsi_cmd_write10_t const * p_write10 = (const void *)p_msc_ctx->cbw.cdb;
    if (p_msc_ctx->cbw.cdb_length < sizeof(app_usbd_scsi_cmd_write10_t))
    {
        return unsupported_start(p_inst);
    }

    if (p_msc_ctx->cbw.lun >= p_msc->specific.inst.block_devs_count)
    {
        return unsupported_start(p_inst);
    }

    if (uint32_decode(p_msc_ctx->cbw.datlen) == 0)
    {
        return csw_wait_start(p_inst, APP_USBD_MSC_CSW_STATUS_FAIL);
    }


    if ((p_msc_ctx->cbw.flags & APP_USBD_MSC_CBW_DIRECTION_IN) != 0)
    {
        return unsupported_start(p_inst);
    }

    nrf_block_dev_t const * p_blkd = p_msc->specific.inst.pp_block_devs[p_msc_ctx->cbw.lun];

