labapart/polymcu/Device/Nordic/nRF5_SDK/components/libraries/usbd/class/msc/app_usbd_msc.c
            size_t len = app_usbd_string_desc_length(p_serial_str) / sizeof(uint16_t);
            if (len < APP_USBD_MSC_MINIMAL_SERIAL_STRING_SIZE)
            {
                return NRF_ERROR_NOT_SUPPORTED;
            }

            for (size_t i = 1; i < len; ++i)
            {
                if (isxdigit(p_serial_str[i]) == 0)
                {
                    return NRF_ERROR_NOT_SUPPORTED;
                }
            }

            ret = app_usbd_class_sof_register(p_inst);
            if (ret != NRF_SUCCESS)
            {
                break;
            }

            break;
        }
        case APP_USBD_EVT_INST_REMOVE:
        {
            ret = app_usbd_class_sof_unregister(p_inst);
            break;
        }
        case APP_USBD_EVT_START:
        {
            /*Initialize all block devices*/
            ASSERT(p_msc->specific.inst.block_devs_count <= 16);
            for (size_t i = 0; i < p_msc->specific.inst.block_devs_count; ++i)
            {
                nrf_block_dev_t const * p_blk_dev = p_msc->specific.inst.pp_block_devs[i];
                ret = nrf_blk_dev_init(p_blk_dev, msc_blockdev_ev_handler, p_msc);
                if (ret != NRF_SUCCESS)
                {
                    continue;
                }

                p_msc_ctx->blk_dev_init_mask |= 1u << i;
                ASSERT(nrf_blk_dev_geometry(p_blk_dev)->blk_size <=
                       p_msc->specific.inst.block_buff_size);
            }

            user_event_handler(p_inst, &p_msc->specific.inst, APP_USBD_MSC_USER_EVT_START);
            break;
        }
        case APP_USBD_EVT_STOP:
        {
            /*Un-initialize all block devices*/
            ASSERT(p_msc->specific.inst.block_devs_count <= 16);
            size_t i;
            for (i = 0; i < p_msc->specific.inst.block_devs_count; ++i)
            {
                nrf_block_dev_t const * p_blk_dev = p_msc->specific.inst.pp_block_devs[i];
                ret = nrf_blk_dev_uninit(p_blk_dev);
                if (ret != NRF_SUCCESS)
                {
                    continue;
                }

                p_msc_ctx->blk_dev_init_mask &= ~(1u << i);
            }

            user_event_handler(p_inst, &p_msc->specific.inst, APP_USBD_MSC_USER_EVT_STOP);
            break;
        }
        default:
            ret = NRF_ERROR_NOT_SUPPORTED;
            break;
    }

    return ret;
}

/**
 * @brief @ref app_usbd_class_methods_t::get_descriptors
 */
static const void * msc_get_descriptors(app_usbd_class_inst_t const * p_inst, size_t * p_size)
{
    ASSERT(p_size != NULL);
    app_usbd_msc_t const *  p_msc = msc_get(p_inst);

    *p_size = p_msc->specific.inst.raw_desc_size;
    return p_msc->specific.inst.p_raw_desc;
}

const app_usbd_class_methods_t app_usbd_msc_class_methods = {
        .event_handler = msc_event_handler,
        .get_descriptors = msc_get_descriptors,
};


/**
 * @brief Block device read done event handler.
 *
 * @ref NRF_BLOCK_DEV_EVT_BLK_READ_DONE
 *
 * @param p_blk_dev     Block device handle
 * @param p_event       Block device event
 *
 * */
static void msc_blockdev_read_done_handler(nrf_block_dev_t const * p_blk_dev,
                                           nrf_block_dev_event_t const * p_event)
{
    ret_code_t ret;

    app_usbd_class_inst_t const * p_inst = p_event->p_context;
    app_usbd_msc_t const *        p_msc = msc_get(p_inst);
    app_usbd_msc_ctx_t *          p_msc_ctx = msc_ctx_get(p_msc);

    uint32_t blk_cnt = p_msc_ctx->current.blk_count;
    uint32_t blk_size = p_msc_ctx->current.blk_size;

    /*Save actual request*/
    size_t req_pos = (p_msc_ctx->current.workbuff_pos != 0) ? 1 : 0;
    p_msc_ctx->current.req = *p_event->p_blk_req;

    p_msc_ctx->current.block_req_in_progress = false;

    /*Decrement transfer counter*/
    p_msc_ctx->current.blk_idx += blk_cnt;
    if (p_msc_ctx->current.blk_datasize > blk_size * blk_cnt)
    {
        p_msc_ctx->current.blk_datasize -= blk_size * blk_cnt;
    }
    else
    {
        p_msc_ctx->current.blk_datasize = 0;
    }

    NRF_LOG_DEBUG("read_done_handler: p_buff: %p, size: %u data size: %u req_pos: %u\r\n",
                  (uint32_t)p_event->p_blk_req->p_buff,
                  p_event->p_blk_req->blk_count,
                  p_msc_ctx->current.blk_datasize,
                  req_pos);

    /*Calculate next block request size*/
    p_msc_ctx->current.blk_count = next_transfer_blkcnt_calc(p_msc, p_msc_ctx);

    if (!p_msc_ctx->current.trans_in_progress)
    {
        /*Trigger new transfer.*/
        p_msc_ctx->current.trans_req_id = req_pos;
        nrf_block_req_t * p_req = &p_msc_ctx->current.req;

        ret = transfer_in_start(p_inst,
                                p_req->p_buff,
                                p_req->blk_count * blk_size,
                                APP_USBD_MSC_STATE_DATA_IN);
        if (ret != NRF_SUCCESS)
        {
            UNUSED_RETURN_VALUE(unsupported_start(p_inst));
        }
        else
        {
            /*Clear processed block request.*/
            memset(p_req, 0, sizeof(nrf_block_req_t));
            p_msc_ctx->current.trans_in_progress = true;
        }

    }

    if (p_msc_ctx->current.req_busy_mask == APP_USBD_MSC_REQ_BUSY_FULL_MASK)
    {
        /* No need to perform next block read request. USB transfers need to catch-up
         * block device readings */
        return;
    }

    if (p_msc_ctx->current.blk_count == 0)
    {
        /*All data has been read. No need to trigger new block request.*/
        return;
    }

    /*Trigger new block read request*/
    p_msc_ctx->current.workbuff_pos ^= p_msc->specific.inst.block_buff_size;
    req_pos = p_msc_ctx->current.workbuff_pos != 0 ? 1 : 0;

    APP_USBD_MSC_REQ_BUSY_SET(p_msc_ctx->current.req_busy_mask, req_pos);

    NRF_BLOCK_DEV_REQUEST(req,
                          p_msc_ctx->current.blk_idx,
                          p_msc_ctx->current.blk_count,
                          ((uint8_t *)p_msc->specific.inst.p_block_buff +
                          p_msc_ctx->current.workbuff_pos));


    NRF_LOG_DEBUG("nrf_blk_dev_read_req 2: id: %u, count: %u, left: %u, ptr: %p\r\n",
                  req.blk_id,
                  req.blk_count,
                  p_msc_ctx->current.blk_datasize,
                  (uint32_t)req.p_buff);

    ret = nrf_blk_dev_read_req(p_blk_dev, &req);
    NRF_LOG_DEBUG("nrf_blk_dev_read_req 2: ret: %u\r\n", ret);

    if (ret != NRF_SUCCESS)
    {
        UNUSED_RETURN_VALUE(unsupported_start(p_inst));
    }
}

/**
 * @brief Block device write done event handler.
 *
 * @ref NRF_BLOCK_DEV_EVT_BLK_WRITE_DONE
 *
 * @param p_blk_dev     Block device handle
 * @param p_event       Block device event
 *
 * */
static void msc_blockdev_write_done_handler(nrf_block_dev_t const * p_blk_dev,
                                            nrf_block_dev_event_t const * p_event)
{
    app_usbd_class_inst_t const * p_inst = p_event->p_context;
    app_usbd_msc_t const *        p_msc = msc_get(p_inst);
    app_usbd_msc_ctx_t *          p_msc_ctx = msc_ctx_get(p_msc);

    uint32_t blk_cnt = p_msc_ctx->current.blk_count;
    uint32_t blk_size = p_msc_ctx->current.blk_size;

