labapart/polymcu/Device/Nordic/nRF5_SDK/components/libraries/usbd/class/msc/app_usbd_msc.c
    /*Save actual request*/
    size_t req_pos = (p_event->p_blk_req->p_buff == p_msc->specific.inst.p_block_buff) ? 0 : 1;
    p_msc_ctx->current.req = *p_event->p_blk_req;

    APP_USBD_MSC_REQ_BUSY_CLR(p_msc_ctx->current.req_busy_mask, req_pos);
    p_msc_ctx->current.block_req_in_progress = false;

    p_msc_ctx->current.blk_idx += blk_cnt;

    if (p_msc_ctx->current.blk_datasize > blk_size * blk_cnt)
    {
        p_msc_ctx->current.blk_datasize -= blk_size * blk_cnt;
    }
    else
    {
        p_msc_ctx->current.blk_datasize = 0;
    }

    NRF_LOG_DEBUG("write_done_handler: p_buff: %p, size: %u data size: %u req_pos: %u\r\n",
                  (uint32_t)p_event->p_blk_req->p_buff,
                  p_event->p_blk_req->blk_count,
                  p_msc_ctx->current.blk_datasize,
                  req_pos);

    if (p_msc_ctx->current.blk_datasize == 0)
    {
        p_msc_ctx ->current.blk_idx = p_msc_ctx ->current.blk_size = 0;
        UNUSED_RETURN_VALUE(csw_wait_start(p_inst, p_msc_ctx->current.csw_status));
        return;
    }

    if (p_msc_ctx->current.blk_datasize <= p_msc_ctx->current.blk_count * blk_size)
    {
        size_t pos = p_msc_ctx->current.workbuff_pos;;
        if (p_msc_ctx->current.req_busy_mask != APP_USBD_MSC_REQ_BUSY_FULL_MASK)
        {
            pos ^= p_msc->specific.inst.block_buff_size;
        }

        NRF_BLOCK_DEV_REQUEST(req,
                              p_msc_ctx->current.blk_idx,
                              p_msc_ctx->current.blk_count,
                              ((uint8_t *)p_msc->specific.inst.p_block_buff + pos));

        NRF_LOG_DEBUG("nrf_blk_dev_write_req 2: id: %u, count: %u, left: %u, ptr: %p\r\n",
                      req.blk_id,
                      req.blk_count,
                      p_msc_ctx->current.blk_datasize,
                      (uint32_t)req.p_buff);

        p_msc_ctx->current.block_req_in_progress = true;
        ret_code_t ret = nrf_blk_dev_write_req(p_blk_dev, &req);
        NRF_LOG_DEBUG("nrf_blk_dev_write_req 2: ret: %u\r\n", ret);

        if (ret != NRF_SUCCESS)
        {
            UNUSED_RETURN_VALUE(unsupported_start(p_inst));
        }

        return;
    }

    if (!p_msc_ctx->current.trans_in_progress &&
        (p_msc_ctx->current.blk_datasize  > p_msc_ctx->current.blk_count * blk_size))
    {
        size_t size = p_msc_ctx->current.blk_datasize - p_msc_ctx->current.blk_count * blk_size;
        if (size > p_msc_ctx->current.blk_count * blk_size)
        {
            size = p_msc_ctx->current.blk_count * blk_size;
        }

        if (size > 0)
        {
            /*Trigger new transfer.*/
            p_msc_ctx->current.blk_count = next_transfer_blkcnt_calc(p_msc, p_msc_ctx);
            ret_code_t ret = transfer_out_start(p_inst,
                                                ((uint8_t *)p_msc->specific.inst.p_block_buff +
                                                p_msc_ctx->current.workbuff_pos),
                                                size,
                                                APP_USBD_MSC_STATE_DATA_OUT);
            if (ret == NRF_SUCCESS)
            {
                p_msc_ctx->current.trans_req_id ^= 1;
                APP_USBD_MSC_REQ_BUSY_SET(p_msc_ctx->current.req_busy_mask,
                                          p_msc_ctx->current.trans_req_id);
                p_msc_ctx->current.workbuff_pos ^= p_msc->specific.inst.block_buff_size;
                p_msc_ctx->current.trans_in_progress = true;
            }
            else
            {
                UNUSED_RETURN_VALUE(unsupported_start(p_inst));
            }
        }
    }
}


/**
 * @brief Block device event handler.
 *
 * Mass storage block device event handler. Need to be pined to all block devices
 * from initializer list.
 *
 * @param p_blk_dev     Block device handle
 * @param p_event       Block device event
 *
 * */
static void msc_blockdev_ev_handler(nrf_block_dev_t const * p_blk_dev,
                                    nrf_block_dev_event_t const * p_event)
{
    switch (p_event->ev_type) {
        case NRF_BLOCK_DEV_EVT_INIT:
            break;
        case NRF_BLOCK_DEV_EVT_UNINIT:
            break;
        case NRF_BLOCK_DEV_EVT_BLK_READ_DONE:
            CRITICAL_REGION_ENTER();
            msc_blockdev_read_done_handler(p_blk_dev, p_event);
            CRITICAL_REGION_EXIT();
            break;
        case NRF_BLOCK_DEV_EVT_BLK_WRITE_DONE:
            CRITICAL_REGION_ENTER();
            msc_blockdev_write_done_handler(p_blk_dev, p_event);
            CRITICAL_REGION_EXIT();
            break;
        default:
            break;
    }
}

/** @} */

#endif // APP_USBD_CLASS_MSC_ENABLED
